---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamLocationGeneric
source: html/a148277c-bb51-e0bb-5544-bdca9e8ced7c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamLocationGeneric Property

"Location": Fabric location in the host.

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamLocationGeneric { get; }
```